app/Controllers/Curso.php

    public function mostrar($nav=null)
    {
        $data['title']="Mostrar Cursos";


        $carreraModel = model('CursoModel');
        $data['cursos'] = $carreraModel->findAll();
        $data['totalCursos'] = $carreraModel->countAll();
---
SELECT *
FROM `curso`
SELECT COUNT(*) AS `numrows` FROM `curso`