app/Controllers/Estudiante.php

SELECT *
FROM `Grados`
SELECT *
FROM `Grupos`
---
    public function agregar(){
        helper(['form','url']);
        $gradoModel = model('GradoModel');
        $grupoModel = model('GrupoModel');

        $data['grados'] = $gradoModel->findAll();
        $data['grupos'] = $grupoModel->findAll();

SELECT *
FROM `Estudiante`
WHERE `Estudiante`.`deleted_at` IS NULL
---
    public function buscar(){
        $estudianteModel = model('EstudianteModel');
        if(isset($_GET['nombre'])){
            $nombre = $_GET['nombre'];
            $direccion=$_GET['direccion'];
            $data['estudiantes']= $estudianteModel->like('nombre',$nombre)
                                ->Like('direccion',$direccion)
                                ->findAll();
        }
        else{
            $nombre = "";
            $data['estudiantes']=$estudianteModel->findAll();