app/Controllers/Profesor.php

SELECT *
FROM `Grados`
SELECT *
FROM `Grupos`
---
    public function agregar(){
        helper(['form','url']);
        $gradoModel = model('GradoModel');
        $grupoModel = model('GrupoModel');

        $data['grados'] = $gradoModel->findAll();
        $data['grupos'] = $grupoModel->findAll();