app/Controllers/UserController.php

    public function index()
    {
        $data['title']="Agregar Curso";
        $validation =  \Config\Services::validation();
            if (strtolower($this->request->getMethod()) === 'get'){
                return view('common/head') .
                view('usuario/login') .
                view('common/footer');
            }

            $rules = [
                'email' => 'required',
                'password'=>'required'
            ];

            if (! $this->validate($rules)) {
                return view('common/head') .
                view('usuario/login') .
                view('common/footer');
            }
            else{

                $email = $_POST['email'];
                $password = $_POST['password'];
                $userModel = model('UserModel');
                $data['usuario']= $userModel->like('email',$email)
                                ->Like('pass',$password)
                                ->findAll();
---
SELECT *
FROM `Usuarios`
WHERE `email` LIKE '%robot7@gmail.com%' ESCAPE '!'
AND  `pass` LIKE '%1234%' ESCAPE '!'